accscms-test/TempXML/GateWay/abil.xml

<?xml version="1.0" encoding="UTF-8" standalone="no" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <abi:AirWaybill
            xmlns:abi="http://ebxml.customs.go.th/schema/AirWaybill_5_01">
	<DocumentHeader>
		<DocumentReference>
			<ReferenceNo>?</ReferenceNo>
			<RecvControlNo>?</RecvControlNo>
			<ProcessIndicator>?</ProcessIndicator>
			<MessageFunction>?</MessageFunction>
			<OriginCountryCode>?</OriginCountryCode>
			<UserId>?</UserId>
		</DocumentReference>
		<ConsignmentInformation>
			<ForwarderReference>
				<ForwarderAssignedID>?</ForwarderAssignedID>
				<TaxReference>?</TaxReference>
			</ForwarderReference>
			<ConsignmentTransportDetails>
				<TransportMeans>
					<MasterBLNo>?</MasterBLNo>
				</TransportMeans>
				<PortOfLoading>
					<LoadingLocationID>?</LoadingLocationID>
				</PortOfLoading>
				<PortOfDischarge>
					<DischargeLocationID>?</DischargeLocationID>
				</PortOfDischarge>
				<DeliveryLocation>
					<DeliveryLocationID>?</DeliveryLocationID>
					<ShedNo>?</ShedNo>
				</DeliveryLocation>
			</ConsignmentTransportDetails>
		</ConsignmentInformation>
	</DocumentHeader>
	<DocumentDetailsTransport>
		<GoodsItem>
			<HouseBLNo>?</HouseBLNo>
			<ItemDescription>?</ItemDescription>
			<DangerousGoods>?</DangerousGoods>
			<GoodsItemPackaging>
				<ShippingMark>?</ShippingMark>
				<NumberOfPackages>?</NumberOfPackages>
				<UnitOfPackages>?</UnitOfPackages>
			</GoodsItemPackaging>
			<GoodsItemMeasurements>
				<GrossWeight>
					<Measure>?</Measure>
					<MeasureUnitCode>?</MeasureUnitCode>
				</GrossWeight>
			</GoodsItemMeasurements>
			<GoodsItemValue>
				<FOBValue>?</FOBValue>
				<FOBCurrencyCode>?</FOBCurrencyCode>
				<FreightValue>?</FreightValue>
				<FreightCurrencyCode>?</FreightCurrencyCode>
				<InsuranceValue>?</InsuranceValue>
				<InsuranceCurrencyCode>?</InsuranceCurrencyCode>
			</GoodsItemValue>
			<ConsignorParty>
				<AddressStructured>
					<Name>?</Name>
					<Street>?</Street>
					<District>?</District>
					<SubProvince>?</SubProvince>
					<Province>?</Province>
					<PostCode>?</PostCode>
					<CountryCode>?</CountryCode>
				</AddressStructured>
				<PhoneNo>?</PhoneNo>
			</ConsignorParty>
			<C_N_Party>C</C_N_Party>
			<ConsigneeParty>
				<AddressStructured>
					<Name>?</Name>
					<Street>?</Street>
					<District>?</District>
					<SubProvince>?</SubProvince>
					<Province>?</Province>
					<PostCode>?</PostCode>
					<CountryCode>?</CountryCode>
				</AddressStructured>
				<PhoneNo>?</PhoneNo>
			</ConsigneeParty>
			<NotifyParty>
				<AddressStructured>
					<Name>?</Name>
					<Street>?</Street>
					<District>?</District>
					<SubProvince>?</SubProvince>
					<Province>?</Province>
					<PostCode>?</PostCode>
					<CountryCode>?</CountryCode>
				</AddressStructured>
				<PhoneNo>?</PhoneNo>
			</NotifyParty>
			<LastEntry>?</LastEntry>
		</GoodsItem>
	</DocumentDetailsTransport>         
        </abi:AirWaybill>
    </soap:Body>
</soap:Envelope>